# Задача №19. Решение в группах
# Дана последовательность из N целых чисел и число K. Необходимо сдвинуть всю последовательность
# (сдвиг - циклический) на K элементов вправо,  K –положительное число.
# Input:   [1, 2, 3, 4, 5] k = 2
# Output:  [4, 5, 1, 2, 3]
# Примечание: Пользователь может вводить значения списка или список задан изначально.


list = [1, 2, 3, 4, 5]
s = len(list)
k = 2
list_temp = list
for i in list:
    list_temp[i] =
    print(list_temp)
